## Staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.wordpress_service must be replaced
-/+ resource "aws_ecs_service" "wordpress_service" {
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:729164266357:service/wordpress/wordpress" -> (known after apply)
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:54" -> (known after apply)
        # (13 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }


      + load_balancer { # forces replacement
          + container_name   = "apache"
          + container_port   = 443
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:729164266357:targetgroup/wp20211210200504086000000001/e4d59be782ffb07a"
        }
      - load_balancer { # forces replacement
          - container_name   = "apache" -> null
          - container_port   = 8443 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:729164266357:targetgroup/wp20211210200504086000000001/e4d59be782ffb07a" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:54" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                  ~ image            = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.0.18" -> "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.0.19"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          ~ containerPort = 8443 -> 443
                          ~ hostPort      = 8443 -> 443
                            # (1 unchanged element hidden)
                        },
                    ]
                    # (4 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - cpu              = 0 -> null
                  - mountPoints      = [] -> null
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 54 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>